<a href="https://colab.research.google.com/github/MRS88/AI_course/blob/master/%D0%BD%D0%B5%D0%B4%D0%B5%D0%BB%D1%8F_04_Pandas_%D0%A7%D0%B0%D1%81%D1%82%D1%8C_2/Pandas_2_%D0%A0%D0%B0%D0%B7%D0%B1%D0%BE%D1%80_%D0%B4%D0%BE%D0%BC%D0%B0%D1%88%D0%BD%D0%B5%D0%B3%D0%BE_%D0%B7%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D1%8F_Ultra_Light_%D0%A3%D0%BD%D0%B8%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D1%82%D0%B5%D1%82_%D0%98%D1%81%D0%BA%D1%83%D1%81%D1%81%D1%82%D0%B2%D0%B5%D0%BD%D0%BD%D0%BE%D0%B3%D0%BE_%D0%98%D0%BD%D1%82%D0%B5%D0%BB%D0%BB%D0%B5%D0%BA%D1%82%D0%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Задача 1

Загрузите таблицу city_temperature.csv в pandas DataFrame. При помощи встроенных методов библиотеки Pandas найдите количество стран, среднее значение температуры в которых бывает больше 100 градусов по Фаренгейту.

**Циклы и условия использовать нельзя**.

Описание базы:
---------------------------------
**Region** - регион

**Country** - страна 

**State** - штат (если есть) 

**Month** - месяц 

**Day** - день 

**Year** - год 

**AvgTemperature** - средняя температура в Фаренгейтах

Ссылка на базу: https://drive.google.com/file/d/1bLiz_81Kb4pMryEalRe66jS38_F6vwMX/view?usp=sharing

**Решение:**

In [ ]:
import pandas as pd #Импортируем Pandas

In [ ]:
#Подключаем Google Диск
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
df = pd.read_csv('/content/drive/My Drive/Базы/city_temperature.csv') #Читаем базу 
df.head() # Отображаем первые 5 строк датафрейма df

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

In [ ]:
#При помощи маски определяем нужные данные, выбираем столбец и применяем метод для вывода уникальных значений в столбце
df[df.AvgTemperature > 100].Country.nunique()

15

### Задача 2

Найдите медиану столбца AvgTemperature при помощи встроенных методов библиотеки Pandas.

**Решение:**

In [ ]:
#Считаем медиану в столбце
df.AvgTemperature.median()

62.5

### Задача 3

Найдите число записей в базе данных для первого января 1995 года или первого января 2018 года при помощи масок.

**Решение:**

In [ ]:
#При помощи неоднократного использования масок и логических операторов выводим размерность полученной выборки
df[((df.Day == 1) & (df.Month == 1) & (df.Year == 1995)) | ((df.Day == 1) & (df.Month == 1) & (df.Year == 2018))].shape[0]

612

### Задание 4

**Решение:**

Получите список всех уникальных значений стран в таблице при помощи встроенных методов.

In [ ]:
#Сохраняем в переменную уникальные страны в столбце Country
countries = df.Country.unique().tolist()

### Задача 5
При помощи переводчика или при помощи своих знаний переведите названия столбцов на русский язык. Замените в таблице английские названия столбцов на русские.

**Решение:**

In [ ]:
#Определяем новые названия для столбцов
columns = ['Регион', 'Страна', 'Штат', 'Город', 'Месяц', 'День', 'Год', 'Стредняя температура']
#Переименовываем столбцы
df.columns = columns

In [ ]:
df #Смотрим, что получилось

                Регион   Страна  ...   Год Стредняя температура
0               Africa  Algeria  ...  1995                 64.2
1               Africa  Algeria  ...  1995                 49.4
2               Africa  Algeria  ...  1995                 48.8
3               Africa  Algeria  ...  1995                 46.4
4               Africa  Algeria  ...  1995                 47.9
...                ...      ...  ...   ...                  ...
2906322  North America       US  ...  2013                 82.4
2906323  North America       US  ...  2013                 81.6
2906324  North America       US  ...  2013                 84.2
2906325  North America       US  ...  2013                 83.8
2906326  North America       US  ...  2013                 83.6

[2906327 rows x 8 columns]